In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

In [3]:
%%sql
create database if not exists tutorial;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [4]:
%%sql
use tutorial;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql
drop table if exists tutorial.customer_data;
create table customer_data(
    id INT PRIMARY KEY ,
    customer_name VARCHAR(100) NOT NULL,
    email VARCHAR(100),
    phone_number VARCHAR(100),
    address VARCHAR(100),
    amount DECIMAL(10,2)
);

INSERT INTO tutorial.customer_data (id, customer_name, email, phone_number, address, amount)
VALUES
(1, 'Ravi', 'ravi@example.com', '9876543210', 'Chennai', 5000.00),
(2, 'Priya', NULL, '9876543211', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '9876543212', NULL, 3000.00);
select * from tutorial.customer_data

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
5 rows affected.
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '9876543210', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '9876543211', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '9876543212', None, Decimal('3000.00'))]

Null data cannot be used with operators

In [6]:
%%sql
select count(*) from customer_data where phone_number=NULL

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(0,)]

In [7]:
%%sql
select count(*) from customer_data where phone_number is null

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(2,)]

null is stored as string below

In [11]:
%%sql
INSERT INTO tutorial.customer_data (id, customer_name, email, phone_number, address, amount)
VALUES
(6, 'Ravi', 'ravi@example.com', '9876543210', 'null', 5000.00)

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '6' for key 'customer_data.PRIMARY'
[SQL: INSERT INTO tutorial.customer_data (id, customer_name, email, phone_number, address, amount)
VALUES
(6, 'Ravi', 'ravi@example.com', '9876543210', 'null', 5000.00)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [12]:
%%sql
select count(*) from customer_data where address = 'null'

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(1,)]

In [13]:
%%sql
select count(*) * from customer_data where address is 'null'

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'from customer_data where address is 'null'' at line 1
[SQL: select count(*) * from customer_data where address is 'null']
(Background on this error at: https://sqlalche.me/e/20/f405)

In [14]:
%%sql
select
    id,
    customer_name,
    email,phone_number,
    address
from tutorial.customer_data
where
    email is null
    or phone_number is null
    or address is null;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(2, 'Priya', None, '9876543211', 'Bangalore'),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad'),
 (4, 'Meena', None, None, 'Mumbai'),
 (5, 'Karthik', 'karthik@example.com', '9876543212', None)]

In [15]:
%%sql
    select
    id,
    customer_name,
    email,phone_number,
    address
from tutorial.customer_data
where
    email is null
    and phone_number is null;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(4, 'Meena', None, None, 'Mumbai')]

Null Handling

In [16]:
%%sql
    select
    id,
    customer_name,
    amount,
    coalesce (amount,0.00)
from tutorial.customer_data

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'Ravi', Decimal('5000.00'), Decimal('5000.00')),
 (2, 'Priya', None, Decimal('0.00')),
 (3, 'Arjun', Decimal('1500.00'), Decimal('1500.00')),
 (4, 'Meena', Decimal('2500.00'), Decimal('2500.00')),
 (5, 'Karthik', Decimal('3000.00'), Decimal('3000.00')),
 (6, 'Ravi', Decimal('5000.00'), Decimal('5000.00'))]

coalesce replaces the null value with the first not null value

In [17]:
%%sql
select coalesce(NULL,NULL,0.00,11)

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('0.00'),)]

IFNULL also can be used but IFNULL only takes two arguements

In [18]:
%%sql
    select
    id,
    customer_name,
    amount,
    IFNULL(amount,0.00)
from tutorial.customer_data

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'Ravi', Decimal('5000.00'), Decimal('5000.00')),
 (2, 'Priya', None, Decimal('0.00')),
 (3, 'Arjun', Decimal('1500.00'), Decimal('1500.00')),
 (4, 'Meena', Decimal('2500.00'), Decimal('2500.00')),
 (5, 'Karthik', Decimal('3000.00'), Decimal('3000.00')),
 (6, 'Ravi', Decimal('5000.00'), Decimal('5000.00'))]

In [19]:
%%sql
    select
    id,
    customer_name,
    phone_number,
    amount,
    coalesce (amount,0.00)
from tutorial.customer_data

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'Ravi', '9876543210', Decimal('5000.00'), Decimal('5000.00')),
 (2, 'Priya', '9876543211', None, Decimal('0.00')),
 (3, 'Arjun', None, Decimal('1500.00'), Decimal('1500.00')),
 (4, 'Meena', None, Decimal('2500.00'), Decimal('2500.00')),
 (5, 'Karthik', '9876543212', Decimal('3000.00'), Decimal('3000.00')),
 (6, 'Ravi', '9876543210', Decimal('5000.00'), Decimal('5000.00'))]